УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/CommonModules/ОбменДаннымиXDTOСервер/Module.bsl
#Область ДоработкиСмарт

//Смарт Фролов+ по заявке № 221 "Товары в пути"
Функция ПолучитьМассивПеремещенийКВыгрузке(Свойство)
	Запрос=Новый Запрос("ВЫБРАТЬ ВЫРАЗИТЬ(Объект КАК Документ.ПоступлениеТоваровНаСклад) Перемещение 
	|ИЗ РегистрСведений.ДополнительныеСведения ГДЕ Свойство=&Свойство И Значение=ИСТИНА");
	Запрос.УстановитьПараметр("Свойство",Свойство);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Перемещение");
КонецФункции

Процедура УдалитьПеремещениеИзОбмена(Ссылка,Свойство)
	МЗ=РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МЗ.Объект=Ссылка;
	МЗ.Свойство=Свойство;
	МЗ.Прочитать();
	МЗ.Удалить();
КонецПроцедуры
// Фролов-

#КонецОбласти

#Область ПеренесеноСдоработками

&ИзменениеИКонтроль("ТаблицаПравилКонвертацииПредопределенныхДанных")
Функция смарт_ТаблицаПравилКонвертацииПредопределенныхДанных(КомпонентыОбмена)

	XMLСхема = КомпонентыОбмена.XMLСхема;
	ВерсияФорматаМенеджераОбмена = КомпонентыОбмена.ВерсияФорматаМенеджераОбмена;

	// Инициализация таблицы правил конвертации.
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ТипДанных");
	ПравилаКонвертации.Колонки.Добавить("ТипXDTO");
	ПравилаКонвертации.Колонки.Добавить("КонвертацииЗначенийПриПолучении");
	ПравилаКонвертации.Колонки.Добавить("КонвертацииЗначенийПриОтправке");

	ПравилаКонвертации.Колонки.Добавить("ИмяПКПД", Новый ОписаниеТипов("Строка"));

	КомпонентыОбмена.МенеджерОбмена.ЗаполнитьПравилаКонвертацииПредопределенныхДанных(КомпонентыОбмена.НаправлениеОбмена, ПравилаКонвертации);

	Для Каждого ПравилоКонвертации Из ПравилаКонвертации Цикл
		ПравилоКонвертации.ТипXDTO = ФабрикаXDTO.Тип(XMLСхема, ПравилоКонвертации.ТипXDTO);
		ПравилоКонвертации.ТипДанных = Тип(ИмяТипаДанныхПоОбъектуМетаданных(ПравилоКонвертации.ТипДанных));
		
		#Вставка
		//++ #Б5354 смарт: Шляпников 12.01.2026 / Новая ставка НДС22. Доработки.
		Если КомпонентыОбмена.УзелКорреспондента = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("УзелДляОбменаУТБеларусь")
			И ПравилоКонвертации.ИмяПКПД = "Перечисление_СтавкиНДС" Тогда
			
			ПравилоКонвертации.КонвертацииЗначенийПриОтправке.Вставить(Перечисления.СтавкиНДС.НДС22, "НДС20");
			ПравилоКонвертации.КонвертацииЗначенийПриОтправке.Вставить(Перечисления.СтавкиНДС.НДС22_122, "НДС20_120");
			
		ИначеЕсли КомпонентыОбмена.УзелКорреспондента = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("УзелДляОбменаУТКазахстан")
			И ПравилоКонвертации.ИмяПКПД = "Перечисление_СтавкиНДС" Тогда
			
			ПравилоКонвертации.КонвертацииЗначенийПриОтправке.Вставить(Перечисления.СтавкиНДС.НДС22, "НДС20");
			ПравилоКонвертации.КонвертацииЗначенийПриОтправке.Вставить(Перечисления.СтавкиНДС.НДС22_122, "НДС20_120");
			
		ИначеЕсли СокрЛП(КомпонентыОбмена.УзелКорреспондента) = "УТ Узбекистан"
			И ПравилоКонвертации.ИмяПКПД = "Перечисление_СтавкиНДС" Тогда
			
			ПравилоКонвертации.КонвертацииЗначенийПриОтправке.Вставить(Перечисления.СтавкиНДС.НДС22, "НДС20");
			ПравилоКонвертации.КонвертацииЗначенийПриОтправке.Вставить(Перечисления.СтавкиНДС.НДС22_122, "НДС20_120");
			
		КонецЕсли;
		//-- #Б5354 смарт: Шляпников 12.01.2026
		#КонецВставки
		
	КонецЦикла;

	ПравилаКонвертации.Индексы.Добавить("ИмяПКПД");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных");
	ПравилаКонвертации.Индексы.Добавить("ТипДанных,ТипXDTO");

	Возврат ПравилаКонвертации;

КонецФункции

#КонецОбласти
